Австралия/src/AccumulationRegisters/IncomeAndExpensesRetained/IncomeAndExpensesRetained.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>IncomeAndExpensesRetained</name>
  <resources>
    <name>AmountIncome</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountExpense</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.FixedAssetSale</types>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.AccountSalesFromConsignee</types>
      <types>DocumentRef.SupplierInvoice</types>
      <types>DocumentRef.PaymentExpense</types>
      <types>DocumentRef.CashReceipt</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.AccountSalesToConsignor</types>
      <types>DocumentRef.CashVoucher</types>
      <types>DocumentRef.ArApAdjustments</types>
      <types>DocumentRef.PaymentReceipt</types>
      <types>DocumentRef.AdditionalExpenses</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/AccumulationRegisters/IncomeAndExpensesRetained/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

// Procedure creates an empty temporary table of records change.
//
Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
	 OR Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then	
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	IncomeAndExpensesRetained.LineNumber AS LineNumber,
	|	IncomeAndExpensesRetained.Company AS Company,
	|	IncomeAndExpensesRetained.PresentationCurrency AS PresentationCurrency,
	|	IncomeAndExpensesRetained.Document AS Document,
	|	IncomeAndExpensesRetained.BusinessLine AS BusinessLine,
	|	IncomeAndExpensesRetained.AmountIncome AS AmountIncomeBeforeWrite,
	|	IncomeAndExpensesRetained.AmountIncome AS AmountIncomeUpdate,
	|	IncomeAndExpensesRetained.AmountIncome AS AmountIncomeOnWrite,
	|	IncomeAndExpensesRetained.AmountExpense AS AmountExpensesBeforeWrite,
	|	IncomeAndExpensesRetained.AmountExpense AS AmountExpensesUpdate,
	|	IncomeAndExpensesRetained.AmountExpense AS AmountExpensesOnWrite
	|INTO RegisterRecordsIncomeAndExpensesRetainedChange
	|FROM
	|	AccumulationRegister.IncomeAndExpensesRetained AS IncomeAndExpensesRetained");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsIncomeAndExpensesRetainedChange", False);
	
EndProcedure

#EndRegion

#EndIf
